janhocn/ECG_TCC/ECG_TCC/frdmk64f/pin_mux.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 * TEXT BELOW IS USED AS SETTING FOR THE PINS TOOL *****************************
 PinsProfile:
 - !!product 'Pins v2.0'
 - !!processor 'MK64FN1M0xxx12'
 - !!package 'MK64FN1M0VLL12'
 - !!mcu_data 'ksdk2_0'
 - !!processor_version '1.0.1'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR THE PINS TOOL ***
 */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

#define SOPT5_UART0TXSRC_UART_TX      0x00u   /*!< UART 0 transmit data source select: UART0_TX pin */

/*************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/*************************************************************************************************/
void BOARD_InitPins(void)
{

#if USE_PROTOTYPE
    CLOCK_EnableClock(kCLOCK_PortC);
    CLOCK_EnableClock(kCLOCK_PortB);
    PORT_SetPinMux(PORTB, PIN22_IDX, kPORT_MuxAsGpio); /* PORTB22 (pin 68) is configured as LED */
    PORT_SetPinMux(PORTB, PIN23_IDX, kPORT_MuxAsGpio); /* PORTB23 (pin 69) is configured as LED */

    PORT_SetPinMux(PORTB, PIN16_IDX, kPORT_MuxAlt3); /* PORTB16 (pin 62) is configured as UART0_RX */
    PORT_SetPinMux(PORTB, PIN17_IDX, kPORT_MuxAlt3); /* PORTB17 (pin 63) is configured as UART0_TX */

    PORT_SetPinMux(PORTC, PIN16_IDX, kPORT_MuxAsGpio); /* PORTC16 (pin 90) is configured as External LED */

    //LEDs
    GPIO_PinInit(GPIOC, PIN16_IDX, &(gpio_pin_config_t )
            { kGPIO_DigitalOutput, (0) });
    GPIO_PinInit(GPIOB, PIN23_IDX, &(gpio_pin_config_t )
            { kGPIO_DigitalOutput, (0) });
    GPIO_PinInit(GPIOB, PIN22_IDX, &(gpio_pin_config_t )
            { kGPIO_DigitalOutput, (1) });

    HOMEButton_InitPin();
#endif

    SDHC_InitPins();

    SIM->SOPT5 = ((SIM->SOPT5 & (~(SIM_SOPT5_UART0TXSRC_MASK))) /* Mask bits to zero which are setting */
    | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX) /* UART 0 transmit data source select: UART0_TX pin */
    );
}

/*************************************************************************************************/
void SDHC_InitPins(void)
{
    CLOCK_EnableClock(kCLOCK_PortE); /* Port E Clock Gate Control: Clock enabled */
    const port_pin_config_t porte0_pin1_config = { kPORT_PullUp, /* Internal pull-up resistor is enabled */
    kPORT_FastSlewRate, /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable, /* Passive filter is disabled */
    kPORT_OpenDrainDisable, /* Open drain is disabled */
    kPORT_HighDriveStrength, /* High drive strength is configured */
    kPORT_MuxAlt4, /* Pin is configured as SDHC0_D1 */
    kPORT_UnlockRegister /* Pin Control Register fields [15:0] are not locked */
    };
    PORT_SetPinConfig(PORTE, PIN0_IDX, &porte0_pin1_config); /* PORTE0 (pin 1) is configured as SDHC0_D1 */
    const port_pin_config_t porte1_pin2_config = { kPORT_PullUp, /* Internal pull-up resistor is enabled */
    kPORT_FastSlewRate, /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable, /* Passive filter is disabled */
    kPORT_OpenDrainDisable, /* Open drain is disabled */
    kPORT_HighDriveStrength, /* High drive strength is configured */
    kPORT_MuxAlt4, /* Pin is configured as SDHC0_D0 */
    kPORT_UnlockRegister /* Pin Control Register fields [15:0] are not locked */
    };
    PORT_SetPinConfig(PORTE, PIN1_IDX, &porte1_pin2_config); /* PORTE1 (pin 2) is configured as SDHC0_D0 */
    const port_pin_config_t porte2_pin3_config = { kPORT_PullUp, /* Internal pull-up resistor is enabled */
    kPORT_FastSlewRate, /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable, /* Passive filter is disabled */
    kPORT_OpenDrainDisable, /* Open drain is disabled */
    kPORT_HighDriveStrength, /* High drive strength is configured */
    kPORT_MuxAlt4, /* Pin is configured as SDHC0_DCLK */
    kPORT_UnlockRegister /* Pin Control Register fields [15:0] are not locked */
    };
    PORT_SetPinConfig(PORTE, PIN2_IDX, &porte2_pin3_config); /* PORTE2 (pin 3) is configured as SDHC0_DCLK */
    const port_pin_config_t porte3_pin4_config = { kPORT_PullUp, /* Internal pull-up resistor is enabled */
    kPORT_FastSlewRate, /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable, /* Passive filter is disabled */
    kPORT_OpenDrainDisable, /* Open drain is disabled */
    kPORT_HighDriveStrength, /* High drive strength is configured */
    kPORT_MuxAlt4, /* Pin is configured as SDHC0_CMD */
    kPORT_UnlockRegister /* Pin Control Register fields [15:0] are not locked */
    };
    PORT_SetPinConfig(PORTE, PIN3_IDX, &porte3_pin4_config); /* PORTE3 (pin 4) is configured as SDHC0_CMD */
    const port_pin_config_t porte4_pin5_config = { kPORT_PullUp, /* Internal pull-up resistor is enabled */
    kPORT_FastSlewRate, /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable, /* Passive filter is disabled */
    kPORT_OpenDrainDisable, /* Open drain is disabled */
    kPORT_HighDriveStrength, /* High drive strength is configured */
    kPORT_MuxAlt4, /* Pin is configured as SDHC0_D3 */
    kPORT_UnlockRegister /* Pin Control Register fields [15:0] are not locked */
    };
    PORT_SetPinConfig(PORTE, PIN4_IDX, &porte4_pin5_config); /* PORTE4 (pin 5) is configured as SDHC0_D3 */
    const port_pin_config_t porte5_pin6_config = { kPORT_PullUp, /* Internal pull-up resistor is enabled */
    kPORT_FastSlewRate, /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable, /* Passive filter is disabled */
    kPORT_OpenDrainDisable, /* Open drain is disabled */
    kPORT_HighDriveStrength, /* High drive strength is configured */
    kPORT_MuxAlt4, /* Pin is configured as SDHC0_D2 */
    kPORT_UnlockRegister /* Pin Control Register fields [15:0] are not locked */
    };
    PORT_SetPinConfig(PORTE, PIN5_IDX, &porte5_pin6_config); /* PORTE5 (pin 6) is configured as SDHC0_D2 */
    const port_pin_config_t porte6_pin7_config = { kPORT_PullDown, /* Internal pull-down resistor is enabled */
    kPORT_FastSlewRate, /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable, /* Passive filter is disabled */
    kPORT_OpenDrainDisable, /* Open drain is disabled */
    kPORT_LowDriveStrength, /* Low drive strength is configured */
    kPORT_MuxAsGpio, /* Pin is configured as PTE6 */
    kPORT_UnlockRegister /* Pin Control Register fields [15:0] are not locked */
    };
    PORT_SetPinConfig(PORTE, PIN6_IDX, &porte6_pin7_config); /* PORTE6 (pin 7) is configured as PTE6 */
}

/*************************************************************************************************/
void DSPI0_InitPins(void)
{
    CLOCK_EnableClock(kCLOCK_PortD); /* Port D Clock Gate Control: Clock enabled */

