janhocn/ECG_TCC/ECG_TCC/frdmk64f/pin_mux.c
    PORT_SetPinMux(PORTD, PIN0_IDX, kPORT_MuxAlt2); /* PORTD0 (pin 93) is configured as SPI0_PCS0 */
    PORT_SetPinMux(PORTD, PIN1_IDX, kPORT_MuxAlt2); /* PORTD1 (pin 94) is configured as SPI0_SCK */
    PORT_SetPinMux(PORTD, PIN2_IDX, kPORT_MuxAlt2); /* PORTD2 (pin 95) is configured as SPI0_SOUT */
    PORT_SetPinMux(PORTD, PIN3_IDX, kPORT_MuxAlt2); /* PORTD3 (pin 96) is configured as SPI0_SIN */
}

/*************************************************************************************************/
void DSPI0_DeinitPins(void)
{
    PORT_SetPinMux(PORTD, PIN0_IDX, kPORT_PinDisabledOrAnalog); /* PORTD0 (pin 93) is disabled */
    PORT_SetPinMux(PORTD, PIN1_IDX, kPORT_PinDisabledOrAnalog); /* PORTD1 (pin 94) is configured as ADC0_SE5b */
    PORT_SetPinMux(PORTD, PIN2_IDX, kPORT_PinDisabledOrAnalog); /* PORTD2 (pin 95) is disabled */
    PORT_SetPinMux(PORTD, PIN3_IDX, kPORT_PinDisabledOrAnalog); /* PORTD3 (pin 96) is disabled */
}

/*************************************************************************************************/
void DSPI1_InitPins(void)
{
#if USE_PROTOTYPE
    CLOCK_EnableClock(kCLOCK_PortD); /* Port D Clock Gate Control: Clock enabled */

    PORT_SetPinMux(PORTD, PIN5_IDX, kPORT_MuxAlt7); /* PORTD5 (pin 98) is configured as SPI1_SCK */
    PORT_SetPinMux(PORTD, PIN6_IDX, kPORT_MuxAlt7); /* PORTD6 (pin 99) is configured as SPI1_SOUT */
    PORT_SetPinMux(PORTD, PIN7_IDX, kPORT_MuxAlt7); /* PORTD7 (pin 100) is configured as SPI1_SIN */
#else
    CLOCK_EnableClock(kCLOCK_PortB); /* Port B Clock Gate Control: Clock enabled */

    PORT_SetPinMux(PORTB, PIN11_IDX, kPORT_MuxAlt2); /* PORTB11 (pin 59) is configured as SPI1_SCK */
    PORT_SetPinMux(PORTB, PIN16_IDX, kPORT_MuxAlt2); /* PORTB16 (pin 62) is configured as SPI1_SOUT */
    PORT_SetPinMux(PORTB, PIN17_IDX, kPORT_MuxAlt2); /* PORTB17 (pin 63) is configured as SPI1_SIN */
#endif
}

/*************************************************************************************************/
void DSPI1_DeinitPins(void)
{
#if USE_PROTOTYPE
    PORT_SetPinMux(PORTD, PIN5_IDX, kPORT_PinDisabledOrAnalog); /* PORTD5 (pin 98) is configured as ADC0_SE6b */
    PORT_SetPinMux(PORTD, PIN6_IDX, kPORT_PinDisabledOrAnalog); /* PORTD6 (pin 99) is configured as ADC0_SE7b */
    PORT_SetPinMux(PORTD, PIN7_IDX, kPORT_PinDisabledOrAnalog); /* PORTD7 (pin 100) is disabled */
#else
    PORT_SetPinMux(PORTB, PIN11_IDX, kPORT_PinDisabledOrAnalog); /* PORTB11 (pin 59) is configured as ADC1_SE15 */
    PORT_SetPinMux(PORTB, PIN16_IDX, kPORT_PinDisabledOrAnalog); /* PORTB16 (pin 62) is disabled */
    PORT_SetPinMux(PORTB, PIN17_IDX, kPORT_PinDisabledOrAnalog); /* PORTB17 (pin 63) is disabled */
#endif
}

/*************************************************************************************************/
void DSPI2_InitPins(void)
{
    CLOCK_EnableClock(kCLOCK_PortB); /* Port B Clock Gate Control: Clock enabled */
    PORT_SetPinMux(PORTB, PIN20_IDX, kPORT_MuxAlt2); /* PORTB20 (pin 66) is configured as SPI0_PCS0 */
    PORT_SetPinMux(PORTB, PIN21_IDX, kPORT_MuxAlt2); /* PORTB21 (pin 67) is configured as SPI0_SCK */
    PORT_SetPinMux(PORTB, PIN22_IDX, kPORT_MuxAlt2); /* PORTB22 (pin 68) is configured as SPI0_SOUT */
    PORT_SetPinMux(PORTB, PIN23_IDX, kPORT_MuxAlt2); /* PORTB23 (pin 69) is configured as SPI0_SIN */
}

/*************************************************************************************************/
void DSPI2_DeinitPins(void)
{
    PORT_SetPinMux(PORTB, PIN20_IDX, kPORT_PinDisabledOrAnalog); /* PORTB20 (pin 66) is configured as SPI0_PCS0 */
    PORT_SetPinMux(PORTB, PIN21_IDX, kPORT_PinDisabledOrAnalog); /* PORTB21 (pin 67) is configured as SPI0_SCK */
    PORT_SetPinMux(PORTB, PIN22_IDX, kPORT_PinDisabledOrAnalog); /* PORTB22 (pin 68) is configured as SPI0_SOUT */
    PORT_SetPinMux(PORTB, PIN23_IDX, kPORT_PinDisabledOrAnalog); /* PORTB23 (pin 69) is configured as SPI0_SIN */
}

/*************************************************************************************************/
void HOMEButton_InitPin(void)
{
#if USE_PROTOTYPE
    //RST
    GPIO_HOME_BUTTON_CLK_ENABLE();

    port_pin_config_t portConfig = {
    GPIO_HOME_BUTTON_PULL,
    GPIO_HOME_BUTTON_SLEWRATE,
    GPIO_HOME_BUTTON_DFILTER,
    GPIO_HOME_BUTTON_OPENDRAIN,
    GPIO_HOME_BUTTON_DRIVESTRENGTH,
    GPIO_HOME_BUTTON_ALT,
    GPIO_HOME_BUTTON_LOCK };

    PORT_SetPinConfig(GPIO_HOME_BUTTON_PORT, GPIO_HOME_BUTTON_PIN, &portConfig);

    //Switch is connected as interrupt
    PORT_SetPinInterruptConfig(GPIO_HOME_BUTTON_PORT, GPIO_HOME_BUTTON_PIN,
    GPIO_HOME_BUTTON_INT);
    GPIO_PinInit(GPIO_HOME_BUTTON_GPIO, GPIO_HOME_BUTTON_PIN, &(gpio_pin_config_t )
            { GPIO_HOME_BUTTON_MODE, GPIO_HOME_BUTTON_INIT_VAL });
#endif
}

/*************************************************************************************************/
void ECGACQ_InitPins(void)
{
#if !USE_PROTOTYPE
    // POWER ENABLE
    GPIO_ECG_POWER_EN_CLK_ENABLE();

    port_pin_config_t portConfig =
    {
        GPIO_ECG_POWER_EN_PULL,
        GPIO_ECG_POWER_EN_SLEWRATE,
        GPIO_ECG_POWER_EN_DFILTER,
        GPIO_ECG_POWER_EN_OPENDRAIN,
        GPIO_ECG_POWER_EN_DRIVESTRENGTH,
        GPIO_ECG_POWER_EN_ALT,
        GPIO_ECG_POWER_EN_LOCK};

    PORT_SetPinConfig(GPIO_ECG_POWER_EN_PORT, GPIO_ECG_POWER_EN_PIN, &portConfig);

    GPIO_PinInit(GPIO_ECG_POWER_EN_GPIO, GPIO_ECG_POWER_EN_PIN, &(gpio_pin_config_t )
            {   GPIO_ECG_POWER_EN_MODE, GPIO_ECG_POWER_EN_INIT_VAL});
#else
    GPIO_ECG_IN_CLK_ENABLE();
    PORT_SetPinMux(GPIO_ECG_IN_PORT, GPIO_ECG_IN_PIN, GPIO_ECG_IN_ALT);
#endif
}

/*************************************************************************************************/
void TFT_InitPins(void)
{
    //RST
    GPIO_TFT_RST_CLK_ENABLE();

    port_pin_config_t portConfig = {
    GPIO_TFT_RST_PULL,
    GPIO_TFT_RST_SLEWRATE,
    GPIO_TFT_RST_DFILTER,
    GPIO_TFT_RST_OPENDRAIN,
    GPIO_TFT_RST_DRIVESTRENGTH,
    GPIO_TFT_RST_ALT,
    GPIO_TFT_RST_LOCK };

    PORT_SetPinConfig(GPIO_TFT_RST_PORT, GPIO_TFT_RST_PIN, &portConfig);

    GPIO_PinInit(GPIO_TFT_RST_GPIO, GPIO_TFT_RST_PIN, &(gpio_pin_config_t )
            { GPIO_TFT_RST_MODE, GPIO_TFT_RST_INIT_VAL });

    //BKL
    GPIO_TFT_BKL_CLK_ENABLE();

    portConfig.pullSelect = GPIO_TFT_BKL_PULL;
    portConfig.slewRate = GPIO_TFT_BKL_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_TFT_BKL_DFILTER;
    portConfig.openDrainEnable = GPIO_TFT_BKL_OPENDRAIN;
    portConfig.driveStrength = GPIO_TFT_BKL_DRIVESTRENGTH;
    portConfig.mux = GPIO_TFT_BKL_ALT;
    portConfig.lockRegister = GPIO_TFT_BKL_LOCK;

    PORT_SetPinConfig(GPIO_TFT_BKL_PORT, GPIO_TFT_BKL_PIN, &portConfig);

    GPIO_PinInit(GPIO_TFT_BKL_GPIO, GPIO_TFT_BKL_PIN, &(gpio_pin_config_t )
            { GPIO_TFT_BKL_MODE, GPIO_TFT_BKL_INIT_VAL });

    //DC
    GPIO_TFT_DC_CLK_ENABLE();

    portConfig.pullSelect = GPIO_TFT_DC_PULL;
    portConfig.slewRate = GPIO_TFT_DC_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_TFT_DC_DFILTER;
    portConfig.openDrainEnable = GPIO_TFT_DC_OPENDRAIN;
    portConfig.driveStrength = GPIO_TFT_DC_DRIVESTRENGTH;
    portConfig.mux = GPIO_TFT_DC_ALT;
    portConfig.lockRegister = GPIO_TFT_DC_LOCK;

    PORT_SetPinConfig(GPIO_TFT_DC_PORT, GPIO_TFT_DC_PIN, &portConfig);

    GPIO_PinInit(GPIO_TFT_DC_GPIO, GPIO_TFT_DC_PIN, &(gpio_pin_config_t )
            { GPIO_TFT_DC_MODE, GPIO_TFT_DC_INIT_VAL });

    //CS
    GPIO_TFT_CS_CLK_ENABLE();

