janhocn/ECG_TCC/ECG_TCC/frdmk64f/pin_mux.c
    portConfig.pullSelect = GPIO_TFT_CS_PULL;
    portConfig.slewRate = GPIO_TFT_CS_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_TFT_CS_DFILTER;
    portConfig.openDrainEnable = GPIO_TFT_CS_OPENDRAIN;
    portConfig.driveStrength = GPIO_TFT_CS_DRIVESTRENGTH;
    portConfig.mux = GPIO_TFT_CS_ALT;
    portConfig.lockRegister = GPIO_TFT_CS_LOCK;

    PORT_SetPinConfig(GPIO_TFT_CS_PORT, GPIO_TFT_CS_PIN, &portConfig);

    GPIO_PinInit(GPIO_TFT_CS_GPIO, GPIO_TFT_CS_PIN, &(gpio_pin_config_t )
            { GPIO_TFT_CS_MODE, GPIO_TFT_CS_INIT_VAL });

#if USE_PROTOTYPE
    DSPI0_InitPins();
#else
    DSPI2_InitPins();
#endif
}

/*************************************************************************************************/
void BQ4075_InitPins(void)
{
    GPIO_CHG_SYSOFF_CLK_ENABLE();

    port_pin_config_t portConfig = {
    GPIO_CHG_SYSOFF_PULL,
    GPIO_CHG_SYSOFF_SLEWRATE,
    GPIO_CHG_SYSOFF_DFILTER,
    GPIO_CHG_SYSOFF_OPENDRAIN,
    GPIO_CHG_SYSOFF_DRIVESTRENGTH,
    GPIO_CHG_SYSOFF_ALT,
    GPIO_CHG_SYSOFF_LOCK };

    PORT_SetPinConfig(GPIO_CHG_SYSOFF_PORT, GPIO_CHG_SYSOFF_PIN, &portConfig);

    GPIO_PinInit(GPIO_CHG_SYSOFF_GPIO, GPIO_CHG_SYSOFF_PIN, &(gpio_pin_config_t )
            { GPIO_CHG_SYSOFF_MODE, GPIO_CHG_SYSOFF_INIT_VAL });

    GPIO_CHG_CE_CLK_ENABLE();

    portConfig.pullSelect = GPIO_CHG_CE_PULL;
    portConfig.slewRate = GPIO_CHG_CE_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_CHG_CE_DFILTER;
    portConfig.openDrainEnable = GPIO_CHG_CE_OPENDRAIN;
    portConfig.driveStrength = GPIO_CHG_CE_DRIVESTRENGTH;
    portConfig.mux = GPIO_CHG_CE_ALT;
    portConfig.lockRegister = GPIO_CHG_CE_LOCK;

    PORT_SetPinConfig(GPIO_CHG_CE_PORT, GPIO_CHG_CE_PIN, &portConfig);

    GPIO_PinInit(GPIO_CHG_CE_GPIO, GPIO_CHG_CE_PIN, &(gpio_pin_config_t )
            { GPIO_CHG_CE_MODE, GPIO_CHG_CE_INIT_VAL });

    GPIO_CHG_EN1_CLK_ENABLE();

    portConfig.pullSelect = GPIO_CHG_EN1_PULL;
    portConfig.slewRate = GPIO_CHG_EN1_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_CHG_EN1_DFILTER;
    portConfig.openDrainEnable = GPIO_CHG_EN1_OPENDRAIN;
    portConfig.driveStrength = GPIO_CHG_EN1_DRIVESTRENGTH;
    portConfig.mux = GPIO_CHG_EN1_ALT;
    portConfig.lockRegister = GPIO_CHG_EN1_LOCK;

    PORT_SetPinConfig(GPIO_CHG_EN1_PORT, GPIO_CHG_EN1_PIN, &portConfig);

    GPIO_PinInit(GPIO_CHG_EN1_GPIO, GPIO_CHG_EN1_PIN, &(gpio_pin_config_t )
            { GPIO_CHG_EN1_MODE, GPIO_CHG_EN1_INIT_VAL });

    GPIO_CHG_EN2_CLK_ENABLE();

    portConfig.pullSelect = GPIO_CHG_EN2_PULL;
    portConfig.slewRate = GPIO_CHG_EN2_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_CHG_EN2_DFILTER;
    portConfig.openDrainEnable = GPIO_CHG_EN2_OPENDRAIN;
    portConfig.driveStrength = GPIO_CHG_EN2_DRIVESTRENGTH;
    portConfig.mux = GPIO_CHG_EN2_ALT;
    portConfig.lockRegister = GPIO_CHG_EN2_LOCK;

    PORT_SetPinConfig(GPIO_CHG_EN2_PORT, GPIO_CHG_EN2_PIN, &portConfig);

    GPIO_PinInit(GPIO_CHG_EN2_GPIO, GPIO_CHG_EN2_PIN, &(gpio_pin_config_t )
            { GPIO_CHG_EN2_MODE, GPIO_CHG_EN2_INIT_VAL });

}

/*************************************************************************************************/
void BQ27441_InitPins(void)
{
    port_pin_config_t portConfig = {
    GPIO_GAUGE_GPOUT_PULL,
    GPIO_GAUGE_GPOUT_SLEWRATE,
    GPIO_GAUGE_GPOUT_DFILTER,
    GPIO_GAUGE_GPOUT_OPENDRAIN,
    GPIO_GAUGE_GPOUT_DRIVESTRENGTH,
    GPIO_GAUGE_GPOUT_ALT,
    GPIO_GAUGE_GPOUT_LOCK };

    GPIO_GAUGE_GPOUT_CLK_ENABLE();

    portConfig.pullSelect = GPIO_GAUGE_GPOUT_PULL;
    portConfig.slewRate = GPIO_GAUGE_GPOUT_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_GAUGE_GPOUT_DFILTER;
    portConfig.openDrainEnable = GPIO_GAUGE_GPOUT_OPENDRAIN;
    portConfig.driveStrength = GPIO_GAUGE_GPOUT_DRIVESTRENGTH;
    portConfig.mux = GPIO_GAUGE_GPOUT_ALT;
    portConfig.lockRegister = GPIO_GAUGE_GPOUT_LOCK;

    PORT_SetPinConfig(GPIO_GAUGE_GPOUT_PORT, GPIO_GAUGE_GPOUT_PIN, &portConfig);
    PORT_SetPinInterruptConfig(GPIO_GAUGE_GPOUT_PORT, GPIO_GAUGE_GPOUT_PIN,
            GPIO_GAUGE_GPOUT_INT);
    GPIO_PinInit(GPIO_GAUGE_GPOUT_GPIO, GPIO_GAUGE_GPOUT_PIN, &(gpio_pin_config_t )
            { GPIO_GAUGE_GPOUT_MODE, GPIO_GAUGE_GPOUT_INIT_VAL });
    I2C1_InitPins();
}

/*************************************************************************************************/
void TSC2007_InitPins(void)
{

    port_pin_config_t portConfig = {
    GPIO_TOUCH_PEN_IRQ_PULL,
    GPIO_TOUCH_PEN_IRQ_SLEWRATE,
    GPIO_TOUCH_PEN_IRQ_DFILTER,
    GPIO_TOUCH_PEN_IRQ_OPENDRAIN,
    GPIO_TOUCH_PEN_IRQ_DRIVESTRENGTH,
    GPIO_TOUCH_PEN_IRQ_ALT,
    GPIO_TOUCH_PEN_IRQ_LOCK };

    GPIO_TOUCH_PEN_IRQ_CLK_ENABLE();

    portConfig.pullSelect = GPIO_TOUCH_PEN_IRQ_PULL;
    portConfig.slewRate = GPIO_TOUCH_PEN_IRQ_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_TOUCH_PEN_IRQ_DFILTER;
    portConfig.openDrainEnable = GPIO_TOUCH_PEN_IRQ_OPENDRAIN;
    portConfig.driveStrength = GPIO_TOUCH_PEN_IRQ_DRIVESTRENGTH;
    portConfig.mux = GPIO_TOUCH_PEN_IRQ_ALT;
    portConfig.lockRegister = GPIO_TOUCH_PEN_IRQ_LOCK;

    PORT_SetPinConfig(GPIO_TOUCH_PEN_IRQ_PORT, GPIO_TOUCH_PEN_IRQ_PIN, &portConfig);
    PORT_SetPinInterruptConfig(GPIO_TOUCH_PEN_IRQ_PORT, GPIO_TOUCH_PEN_IRQ_PIN,
            GPIO_TOUCH_PEN_IRQ_INT);
    GPIO_PinInit(GPIO_TOUCH_PEN_IRQ_GPIO, GPIO_TOUCH_PEN_IRQ_PIN, &(gpio_pin_config_t )
            { GPIO_TOUCH_PEN_IRQ_MODE, GPIO_TOUCH_PEN_IRQ_INIT_VAL });

    I2C0_InitPins();
}

/*************************************************************************************************/
void AFE4400_InitPins(void)
{
    //RST
    GPIO_AFE4400_RST_CLK_ENABLE();

    port_pin_config_t portConfig = {
    GPIO_AFE4400_RST_PULL,
    GPIO_AFE4400_RST_SLEWRATE,
    GPIO_AFE4400_RST_DFILTER,
    GPIO_AFE4400_RST_OPENDRAIN,
    GPIO_AFE4400_RST_DRIVESTRENGTH,
    GPIO_AFE4400_RST_ALT,
    GPIO_AFE4400_RST_LOCK };

    PORT_SetPinConfig(GPIO_AFE4400_RST_PORT, GPIO_AFE4400_RST_PIN, &portConfig);

    GPIO_PinInit(GPIO_AFE4400_RST_GPIO, GPIO_AFE4400_RST_PIN, &(gpio_pin_config_t )
            { GPIO_AFE4400_RST_MODE, GPIO_AFE4400_RST_INIT_VAL });

    //PDN
    GPIO_AFE4400_PDN_CLK_ENABLE();

