janhocn/ECG_TCC/ECG_TCC/frdmk64f/pin_mux.c
    portConfig.pullSelect = GPIO_AFE4400_PDN_PULL;
    portConfig.slewRate = GPIO_AFE4400_PDN_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_AFE4400_PDN_DFILTER;
    portConfig.openDrainEnable = GPIO_AFE4400_PDN_OPENDRAIN;
    portConfig.driveStrength = GPIO_AFE4400_PDN_DRIVESTRENGTH;
    portConfig.mux = GPIO_AFE4400_PDN_ALT;
    portConfig.lockRegister = GPIO_AFE4400_PDN_LOCK;

    PORT_SetPinConfig(GPIO_AFE4400_PDN_PORT, GPIO_AFE4400_PDN_PIN, &portConfig);

    GPIO_PinInit(GPIO_AFE4400_PDN_GPIO, GPIO_AFE4400_PDN_PIN, &(gpio_pin_config_t )
            { GPIO_AFE4400_PDN_MODE, GPIO_AFE4400_PDN_INIT_VAL });

    //CS
    GPIO_AFE4400_CS_CLK_ENABLE();

    portConfig.pullSelect = GPIO_AFE4400_CS_PULL;
    portConfig.slewRate = GPIO_AFE4400_CS_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_AFE4400_CS_DFILTER;
    portConfig.openDrainEnable = GPIO_AFE4400_CS_OPENDRAIN;
    portConfig.driveStrength = GPIO_AFE4400_CS_DRIVESTRENGTH;
    portConfig.mux = GPIO_AFE4400_CS_ALT;
    portConfig.lockRegister = GPIO_AFE4400_CS_LOCK;

    PORT_SetPinConfig(GPIO_AFE4400_CS_PORT, GPIO_AFE4400_CS_PIN, &portConfig);

    GPIO_PinInit(GPIO_AFE4400_CS_GPIO, GPIO_AFE4400_CS_PIN, &(gpio_pin_config_t )
            { GPIO_AFE4400_CS_MODE, GPIO_AFE4400_CS_INIT_VAL });

    //ADC Ready
    GPIO_AFE4400_ADCRDY_CLK_ENABLE();

    portConfig.pullSelect = GPIO_AFE4400_ADCRDY_PULL;
    portConfig.slewRate = GPIO_AFE4400_ADCRDY_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_AFE4400_ADCRDY_DFILTER;
    portConfig.openDrainEnable = GPIO_AFE4400_ADCRDY_OPENDRAIN;
    portConfig.driveStrength = GPIO_AFE4400_ADCRDY_DRIVESTRENGTH;
    portConfig.mux = GPIO_AFE4400_ADCRDY_ALT;
    portConfig.lockRegister = GPIO_AFE4400_ADCRDY_LOCK;

    PORT_SetPinConfig(GPIO_AFE4400_ADCRDY_PORT, GPIO_AFE4400_ADCRDY_PIN, &portConfig);

    GPIO_PinInit(GPIO_AFE4400_ADCRDY_GPIO, GPIO_AFE4400_ADCRDY_PIN, &(gpio_pin_config_t )
            { GPIO_AFE4400_ADCRDY_MODE, GPIO_AFE4400_ADCRDY_INIT_VAL });

#if !USE_PROTOTYPE
    //PDALM
    GPIO_AFE4400_PDALM_CLK_ENABLE();

    portConfig.pullSelect = GPIO_AFE4400_PDALM_PULL;
    portConfig.slewRate = GPIO_AFE4400_PDALM_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_AFE4400_PDALM_DFILTER;
    portConfig.openDrainEnable = GPIO_AFE4400_PDALM_OPENDRAIN;
    portConfig.driveStrength = GPIO_AFE4400_PDALM_DRIVESTRENGTH;
    portConfig.mux = GPIO_AFE4400_PDALM_ALT;
    portConfig.lockRegister = GPIO_AFE4400_PDALM_LOCK;

    PORT_SetPinConfig(GPIO_AFE4400_PDALM_PORT, GPIO_AFE4400_PDALM_PIN, &portConfig);

    GPIO_PinInit(GPIO_AFE4400_PDALM_GPIO, GPIO_AFE4400_PDALM_PIN, &(gpio_pin_config_t )
            {   GPIO_AFE4400_PDALM_MODE, GPIO_AFE4400_PDALM_INIT_VAL});

    //DIAGEND
    GPIO_AFE4400_DIAGEND_CLK_ENABLE();

    portConfig.pullSelect = GPIO_AFE4400_DIAGEND_PULL;
    portConfig.slewRate = GPIO_AFE4400_DIAGEND_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_AFE4400_DIAGEND_DFILTER;
    portConfig.openDrainEnable = GPIO_AFE4400_DIAGEND_OPENDRAIN;
    portConfig.driveStrength = GPIO_AFE4400_DIAGEND_DRIVESTRENGTH;
    portConfig.mux = GPIO_AFE4400_DIAGEND_ALT;
    portConfig.lockRegister = GPIO_AFE4400_DIAGEND_LOCK;

    PORT_SetPinConfig(GPIO_AFE4400_DIAGEND_PORT, GPIO_AFE4400_DIAGEND_PIN, &portConfig);

    GPIO_PinInit(GPIO_AFE4400_DIAGEND_GPIO, GPIO_AFE4400_DIAGEND_PIN, &(gpio_pin_config_t )
            {   GPIO_AFE4400_DIAGEND_MODE, GPIO_AFE4400_DIAGEND_INIT_VAL});

    //LEDALM
    GPIO_AFE4400_LEDALM_CLK_ENABLE();

    portConfig.pullSelect = GPIO_AFE4400_LEDALM_PULL;
    portConfig.slewRate = GPIO_AFE4400_LEDALM_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_AFE4400_LEDALM_DFILTER;
    portConfig.openDrainEnable = GPIO_AFE4400_LEDALM_OPENDRAIN;
    portConfig.driveStrength = GPIO_AFE4400_LEDALM_DRIVESTRENGTH;
    portConfig.mux = GPIO_AFE4400_LEDALM_ALT;
    portConfig.lockRegister = GPIO_AFE4400_LEDALM_LOCK;

    PORT_SetPinConfig(GPIO_AFE4400_LEDALM_PORT, GPIO_AFE4400_LEDALM_PIN, &portConfig);

    GPIO_PinInit(GPIO_AFE4400_LEDALM_GPIO, GPIO_AFE4400_LEDALM_PIN, &(gpio_pin_config_t )
            {   GPIO_AFE4400_LEDALM_MODE, GPIO_AFE4400_LEDALM_INIT_VAL});

    //POWER ENABLE
    GPIO_AFE4400_POWER_EN_CLK_ENABLE();

    portConfig.pullSelect = GPIO_AFE4400_POWER_EN_PULL;
    portConfig.slewRate = GPIO_AFE4400_POWER_EN_SLEWRATE;
    portConfig.passiveFilterEnable = GPIO_AFE4400_POWER_EN_DFILTER;
    portConfig.openDrainEnable = GPIO_AFE4400_POWER_EN_OPENDRAIN;
    portConfig.driveStrength = GPIO_AFE4400_POWER_EN_DRIVESTRENGTH;
    portConfig.mux = GPIO_AFE4400_POWER_EN_ALT;
    portConfig.lockRegister = GPIO_AFE4400_POWER_EN_LOCK;

    PORT_SetPinConfig(GPIO_AFE4400_POWER_EN_PORT, GPIO_AFE4400_POWER_EN_PIN, &portConfig);

    GPIO_PinInit(GPIO_AFE4400_POWER_EN_GPIO, GPIO_AFE4400_POWER_EN_PIN, &(gpio_pin_config_t )
            {   GPIO_AFE4400_POWER_EN_MODE, GPIO_AFE4400_POWER_EN_INIT_VAL});
#endif

    DSPI1_InitPins();
}

/*************************************************************************************************/
void I2C0_InitPins(void)
{
    CLOCK_EnableClock(kCLOCK_PortE);                           /* Port E Clock Gate Control: Clock enabled */

    const port_pin_config_t porte24_pin31_config = {
      kPORT_PullUp,                                            /* Internal pull-up resistor is enabled */
      kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
      kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
      kPORT_OpenDrainEnable,                                   /* Open drain is enabled */
      kPORT_LowDriveStrength,                                  /* Low drive strength is configured */
      kPORT_MuxAlt5,                                           /* Pin is configured as I2C0_SCL */
      kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
    };
    PORT_SetPinConfig(PORTE, PIN24_IDX, &porte24_pin31_config); /* PORTE24 (pin 31) is configured as I2C0_SCL */
    const port_pin_config_t porte25_pin32_config = {
      kPORT_PullUp,                                            /* Internal pull-up resistor is enabled */
      kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
      kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
      kPORT_OpenDrainEnable,                                   /* Open drain is enabled */
      kPORT_LowDriveStrength,                                  /* Low drive strength is configured */
      kPORT_MuxAlt5,                                           /* Pin is configured as I2C0_SDA */
      kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
    };
    PORT_SetPinConfig(PORTE, PIN25_IDX, &porte25_pin32_config); /* PORTE25 (pin 32) is configured as I2C0_SDA */
}

/*************************************************************************************************/
void I2C0_DeinitPins(void)
{
    PORT_SetPinMux(PORTE, PIN24_IDX, kPORT_PinDisabledOrAnalog); /* PORTE24 (pin 31) is configured as ADC0_SE17 */
    PORT_SetPinMux(PORTE, PIN25_IDX, kPORT_PinDisabledOrAnalog); /* PORTE25 (pin 32) is configured as ADC0_SE18 */
}

/*************************************************************************************************/
void I2C1_InitPins(void)
{
    CLOCK_EnableClock(kCLOCK_PortC); /* Port C Clock Gate Control: Clock enabled */

    PORT_SetPinMux(PORTC, PIN10_IDX, kPORT_MuxAlt2); /* PORTC10 (pin 82) is configured as I2C1_SCL */
    PORT_SetPinMux(PORTC, PIN11_IDX, kPORT_MuxAlt2); /* PORTC11 (pin 83) is configured as I2C1_SDA */
}

/*************************************************************************************************/
void I2C1_DeinitPins(void)
{
    PORT_SetPinMux(PORTC, PIN10_IDX, kPORT_PinDisabledOrAnalog); /* PORTC10 (pin 82) is configured as ADC1_SE6b */
    PORT_SetPinMux(PORTC, PIN11_IDX, kPORT_PinDisabledOrAnalog); /* PORTC11 (pin 83) is configured as ADC1_SE7b */
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
